Revit 2026 API

# FamilyInstanceExtensionUtility Property

---

Property to check whether the instance can be extended and return the interface for extension operation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IExtension ExtensionUtility { get; }
```
```vb
Public ReadOnly Property ExtensionUtility As IExtension
	Get
```
```cpp
public:
property IExtension^ ExtensionUtility {
	IExtension^ get ();
}
```
```fsharp
member ExtensionUtility : IExtension with get
```

#### Property Value

IExtension

If the family instance can not support extension operation, it returns

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace